Revit 2024 API
CitySet.Contains Method
Tests for the existence of a city within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Contains(
	City item
)
Visual Basic
Public Overridable Function Contains ( _
	item As City _
) As Boolean
Visual C++
public:
virtual bool Contains(
	City^ item
)
Parameters
item
Type: Autodesk.Revit.DB.City
The city to be searched for.
Return Value
The Contains method returns True if the city is within the set, otherwise False.
See Also
CitySet Class
Autodesk.Revit.DB Namespace